stresstests/answers.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 1000
      name: Warm up
    # - duration: 120
    #   arrivalRate: 5
    #   rampTo: 50
    #   name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load
  payload:
    path: "./testData/answers_spec.csv"
    fields:
      - "id"
      - "question_id"

scenarios:
  - name: "Answers flow"
    flow:
      - get:
          url: "/qa/questions/{{ question_id }}/answers"