stresstests/questions.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 1000
      name: Warm up
    # - duration: 120
    #   arrivalRate: 5
    #   rampTo: 50
    #   name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load

scenarios:
  - name: "Questions flow"
    flow:
      - get:
          url: "/qa/questions?product_id={{$randomNumber(900000, 1000011)}}"